/*



* Подробно разобраться в GitHab
* Настроить камеру от Code Monkey, из его курса про готовку
* Большая и огромная карта, где вначале рандомно справнятся сундуки и мимики, количество врагов все время растет
* Переименовать анимации на Player_Idle
* Создание персонажа через фабрику, прокидывание зависимостей с помощью события и опциональные привязки.
* Добавить Character
* Добавить всплывающую подсказку, если способность на перезарядке возле персонажа текст, что нельзя атаковать => https://www.youtube.com/watch?v=qcvaXzfhYuI&list=PLzDRvYVwl53sN4Ewi_f-iyWZzWNmLG_bI&index=5
* Добавить систему магазина MVP => https://www.youtube.com/watch?v=wH4DRE6pdoE
* Главное меню персонаж и лавки (как в доте 2) => https://www.youtube.com/watch?v=LdoImzaY6M4
* Когда по тебе проходит удар, надпись Hurt













? Ускорение через прыжок 






*/


